digimap2000/auracle/firmware/esp32/apps/auracle/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Networking — enough sockets for multiple SSE clients + REST
CONFIG_LWIP_MAX_SOCKETS=16

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# FreeRTOS — 1ms tick for responsive UART processing
CONFIG_FREERTOS_HZ=1000

# Console — USB-Serial-JTAG (built-in USB on GPIO 19/20), not UART0
# GPIO 43/44 are used for the protocol UART to the nRF5340, so the
# console must be routed to the USB port instead.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# UART
CONFIG_UART_ISR_IN_IRAM=y

# Task stacks
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
